#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.feyre_release.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/virtualNetworks/feyre_prod_containers]
module.feyre_release.azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/virtualNetworks/feyre_prod_containers/subnets/feyre_prod_default_subnet]
module.feyre_release.azurerm_network_profile.net_profile: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/networkProfiles/feyre_prod_container_net_profile]
module.feyre_release.azurerm_container_group.container_group: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.ContainerInstance/containerGroups/feyre_prod]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.feyre_release.azurerm_container_group.container_group will be created
  + resource "azurerm_container_group" "container_group" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + ip_address          = (known after apply)
      + ip_address_type     = "Private"
      + location            = "centralus"
      + name                = "feyre_prod"
      + network_profile_id  = "/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/networkProfiles/feyre_prod_container_net_profile"
      + os_type             = "Linux"
      + resource_group_name = "Feyre"
      + restart_policy      = "Always"
      + tags                = {
          + "managed_by" = "terraform"
        }

      + container {
          + commands                     = [
              + "python",
              + "Feyre.py",
            ]
          + cpu                          = 1
          + environment_variables        = {
              + "ENV" = "prod"
              + "ISS" = "false"
            }
          + image                        = "feyre.azurecr.io/feyre:prod-78a8ac352347e4905a1e2aed9bc6b49ed605e18d"
          + memory                       = 2
          + name                         = "feyre-prod"
          + secure_environment_variables = (sensitive value)

          + ports {
              + port     = 5000
              + protocol = "TCP"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + image_registry_credential {
          + password = (sensitive value)
          + server   = "feyre.azurecr.io"
          + username = "feyre"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @GrantBirki, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Prod 🚀`*